---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ICentralLockedCallback
source: html/600a5841-6e50-d127-bdee-84697624c598.htm
---
# ICentralLockedCallback Members

Returns whether Revit should wait and try again to acquire the lock on central.